In [37]:
import pandas as pd

df = pd.read_csv('basic1.csv')

In [38]:
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [39]:
df.shape

(100, 8)

In [43]:
a = df.head(50)
b = df.tail(50)

In [45]:
a.loc[:, 'f1'] = a['f1'].fillna(a['f1'].median())
b.loc[:, 'f1'] = b['f1'].fillna(b['f1'].max())

C:\Users\pc\AppData\Local\Temp\ipykernel_7764\3349702594.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a.loc[:, 'f1'] = a['f1'].fillna(a['f1'].median())
C:\Users\pc\AppData\Local\Temp\ipykernel_7764\3349702594.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  b.loc[:, 'f1'] = b['f1'].fillna(b['f1'].max())

In [46]:
round(a.f1.std() + b.f1.std(), 2)

42.0

In [30]:
df = pd.read_csv('basic1.csv')

In [31]:
df = df.sort_values(['f4', 'f5'], ascending=[False, True])

In [34]:
df.head()

      id   age city    f1  f2   f3    f4         f5
42  id43  23.0   대구  60.0   0  NaN  ISTP  29.269869
69  id70  -9.0   경기  96.0   1  NaN  ISTP  48.431184
16  id17  74.0   서울   NaN   1  NaN  ISTP  67.886373
22  id23  34.0   부산  75.0   1  NaN  ISTP  69.730313
2   id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986

In [35]:
df.iloc[:10, 7] = df['f5'][:10].min()

In [36]:
round(df.f5.mean(), 2)

53.63

In [47]:
df = pd.read_csv('basic1.csv')

In [48]:
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [51]:
q1, q3 = df['age'].quantile([0.25, 0.75])
iqr = q3 - q1
ub = q3 + iqr * 1.5
lb = q1 - iqr * 1.5
filt = (df['age'] > ub) | (df['age'] < lb)
len(df[filt])

0

In [59]:
mean = df['age'].mean()
std = df['age'].std()
ub1 = mean + std * 1.5
lb1 = mean - std * 1.5
filt1 = (df['age'] > ub1) | (df['age'] < lb1)
len(df[filt1])

14

In [60]:
x_train = pd.read_csv('x_train.csv')
y_train = pd.read_csv('y_train.csv')
x_test = pd.read_csv('x_test.csv')

In [61]:
x_train.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8

In [65]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
dtypes: float64(1), int64(2), object(10)
memory usage: 1.9+ MB

In [66]:
x_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2126 entries, 0 to 2125
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             2126 non-null   int64
 1   city                    2126 non-null   object
 2   city_development_index  2126 non-null   float64
 3   gender                  1616 non-null   object
 4   relevent_experience     2126 non-null   object
 5   enrolled_university     2095 non-null   object
 6   education_level         2074 non-null   object
 7   major_discipline        1816 non-null   object
 8   experience              2121 non-null   object
 9   company_size            1505 non-null   object
 10  company_type            1492 non-null   object
 11  last_new_job            2086 non-null   object
 12  training_hours          2126 non-null   int64
dtypes: float64(1), int64(2), object(10)
memory usage: 216.1+ KB

In [67]:
y_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   enrollee_id  19158 non-null  int64
 1   target       19158 non-null  int64
dtypes: int64(2)
memory usage: 299.5 KB

In [68]:
drop_cols = ['enrollee_id', 'city']
x_train = x_train.drop(columns=drop_cols)
y_train = y_train['target']
test_id = x_test['enrollee_id']
x_test = x_test.drop(columns=drop_cols)

In [69]:
x_train.describe()

       city_development_index  training_hours
count            19158.000000    19158.000000
mean                 0.828848       65.366896
std                  0.123362       60.058462
min                  0.448000        1.000000
25%                  0.740000       23.000000
50%                  0.903000       47.000000
75%                  0.920000       88.000000
max                  0.949000      336.000000

In [70]:
x_test.describe()

       city_development_index  training_hours
count             2126.000000     2126.000000
mean                 0.824974       65.021637
std                  0.125153       60.259748
min                  0.448000        1.000000
25%                  0.698000       23.000000
50%                  0.903000       47.000000
75%                  0.920000       86.000000
max                  0.949000      334.000000

In [71]:
x_train.describe(include='O')

,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job
count,14650,19158,18772,18698,16345,19093,13220,13018,18735
unique,3,2,3,5,6,22,8,6,6
top,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,1
freq,13221,13792,13817,11598,14492,3286,3083,9817,8040

In [72]:
x_test.describe(include='O')

,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job
count,1616,2126,2095,2074,1816,2121,1505,1492,2086
unique,3,2,3,5,6,22,8,6,6
top,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,1
freq,1455,1522,1517,1269,1620,383,338,1139,883

In [73]:
x_train = pd.get_dummies(x_train)
x_test = pd.get_dummies(x_test)

In [74]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import roc_auc_score

In [75]:
x_tr, x_val, y_tr, y_val = train_test_split(x_train, y_train, test_size=0.2, stratify=y_train, random_state=0)

In [84]:
model = RandomForestClassifier(random_state=0, max_depth=10)
model.fit(x_tr, y_tr)
pred = model.predict_proba(x_val)[:, 1]
roc_auc_score(y_val, pred)

0.7942306467433538

In [85]:
pred = model.predict_proba(x_test)[:, 1]
result = pd.DataFrame({
    'enrollee_id' : test_id,
    'target' : pred,
})

ValueError: The feature names should match those that were passed during fit.
Feature names unseen at fit time:
- company_size_10000
Feature names seen at fit time, yet now missing:
- company_size_10000+